#include <stdio.h>
int main(){
	printf("%d\n",sizeof(0.1));//直接輸入0.1是double
	double y=0.1;float x=0.1;
	printf("y=%.10000lf\n",y);
	printf("0.1=%.10000lf\n",0.1); //直接輸入0.1的表現與y=0.1一樣 
	printf("x=%.100f\n",x);//約小數後第九位不一樣 
	
	//0.1=0.1000000000000000100
	printf("%d\n",0.1000000==0.1);
	printf("%d\n",0.1000000001==0.1);//10
	printf("%d\n",0.10000000001==0.1);//11
	printf("%d\n",0.100000000001==0.1);//12
	printf("%d\n",0.1000000000001==0.1);//13
	printf("%d\n",0.10000000000001==0.1);//14
	printf("%d\n",0.100000000000001==0.1);//15
	printf("%d\n",0.1000000000000001==0.1);//16
	printf("%d\n",0.10000000000000001==0.1);//17
	printf("%d\n",0.100000000000000011==0.1);//18
	//double的判定大概要小數後十七位相等!! 
	return 0;
} 
